# GetContourSetting Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ToposolidType..::..GetContourSetting Method
ToposolidType Class See Also
---
Get the contour setting object from the current toposolid type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ContourSetting GetContourSetting()
```

Visual Basic
---
```text
Public Function GetContourSetting As ContourSetting
```

Visual C++
---
```text
public:
ContourSetting^ GetContourSetting()
```

# ### Return Value
The contour setting object.
# See Also
ToposolidType Class
Autodesk.Revit.DB Namespace